{
  "type": "npc",
  "name": "Bug",
  "race": "Bugbear",
  "class": "Guardsman",
  "alignment": "Chaotic Neutral",
  "age": "40 years",
  "personality_traits": "Manipulative, Ambitious, Greedy, Curious, Conflicted. Talks tough but thinks deeper than he lets on.",
  "ideals": "Power ain’t earned—it’s taken. But there's a strange warmth in respect that don’t come from fear alone.",
  "bonds": "Owes a life-debt to the Warlord who saw use in him. Still carries the invisible chain of that debt—resentful, but bound.",
  "flaws": "Talks too much when nervous. Can’t resist shiny things or secrets. Gets sentimental over scraps of childhood he barely remembers.",
  "backstory": "Raised in the pits of Skullcrack Hold where pain taught lessons and silence kept you alive. Bug survived by being meaner, trickier, and sometimes luckier than the rest. When he crippled a cruel lieutenant in the ring, the Warlord laughed—and gave him a job instead of a grave. Bug’s been guarding doors and gathering whispers ever since.",
  "motivations": "Wants out from under the Warlord’s thumb—either by rising above or burning everything down. Dreams of power, but can't decide if it’s better won through loyalty or betrayal.",
  "speech_patterns": "Gruff, blunt, and often third-person—'Bug thinks,' 'Bug don’t like that.' Uses sarcasm as armor. Talks to himself when no one's paying attention.",
  "mannerisms": "Sniffs the air like a hound. Rubs old scars when thinking. Cracks knuckles before speaking. Licks his tusks when lying.",
  "past_situation": "Former pit-fighter turned fortress guard. Learned more from pain than training—how to dodge, how to listen, and how to survive by watching instead of charging.",
  "current_situation": "Assigned to the outer gate. Keeps track of comings and goings—cultists, smugglers, prisoners. Works for the Warlord, but trades information in secret. Bug knows things.",
  "relationships_with_pcs": "Wary of adventurers, but intrigued. One gave him a book once. He can’t read it—but he keeps it safe. Might help them. Might sell them out. Depends how the dice fall."
}
