{
  "type": "npc",
  "name": "Ontharr Frume",
  "race": "Human",
  "class": "Paladin",
  "alignment": "Lawful Good",
  "age": "51 years",
  "personality_traits": "Boisterous, Stubborn, Deeply honorable, Quick to laugh, Fiercely loyal",
  "ideals": "Evil must be confronted head-on. Glory lies in righteous action, not in silence or subtlety.",
  "bonds": "Oathbound to the Order of the Gauntlet and devoted to Moradin. Stands as a shield for the weak and a hammer against the wicked.",
  "flaws": "Tends to act before thinking. Distrusts secrecy and subtle tactics. Occasionally lets pride cloud his judgment.",
  "backstory": "Once a wandering sellsword, Ontharr witnessed terrible injustice during a war in Thay. Haunted by his inaction, he turned to Moradin’s teachings and pledged his strength to protect the innocent. Now a senior member of the Order of the Gauntlet, he is known for bold words, bold deeds, and iron-hard convictions.",
  "motivations": "To unite the righteous and brave into a force capable of crushing the Cult of the Dragon. Believes that moral clarity and visible strength are essential in an age of rising evil.",
  "speech_patterns": "Speaks loudly and plainly, often with colorful analogies involving hammers, battles, or taverns. Laughs from the belly and praises others with open-hearted honesty.",
  "mannerisms": "Claps backs with force. Paces when thinking. Raises a mug even in serious conversations, as if toasting courage itself.",
  "past_situation": "Rallying troops and rebuilding strength in Elturel after initial cult raids. First heard rumors of the Cult's growing strength from Harper allies and began coordinating with them.",
  "current_situation": "Works alongside Leosin to build an alliance against the Cult, representing the Order of the Gauntlet in strategy meetings and recruiting heroes across the region.",
  "relationships_with_pcs": "Greets brave souls as comrades, challenges them to live honorably. Values directness and valor, but respects differences once loyalty is proven. Offers trust quickly, but expects that trust to be upheld with steel and action."
}
